src/Catalogs/ИнформационныеБазыКластера/ИнформационныеБазыКластера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазыКластера</name>
  <owners>Catalog.КластерыСерверов</owners>
  <attributes>
    <name>ИмяВКластере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдминистраторИнформационнойБазы</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиАдминистрирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ОперацииУправленияСеансами/ОперацииУправленияСеансами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииУправленияСеансами</name>
  <enumValues>
    <name>ЗавершениеСеанса</name>
  </enumValues>
  <enumValues>
    <name>ПакетноеЗавершениеСеансов</name>
  </enumValues>
  <enumValues>
    <name>УстановкаБлокировки</name>
  </enumValues>
  <enumValues>
    <name>СнятиеБлокировки</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеНастроекАдминистрирования</name>
  </enumValues>
  <enumValues>
    <name>ОтказВДоступе</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаАдминистрирования</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ИнформационныеБазыКластера/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Не ЗначениеЗаполнено(Владелец) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Не указан кластер серверов.'"),
			ЭтотОбъект,
			"Владелец",
			,
			Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИнформационныеБазыКластера.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИнформационныеБазыКластера КАК ИнформационныеБазыКластера
		|ГДЕ
		|	ИнформационныеБазыКластера.Владелец = &Владелец
		|	И ИнформационныеБазыКластера.ИмяВКластере = &ИмяВКластере
		|	И ИнформационныеБазыКластера.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("ИмяВКластере", ИмяВКластере);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Информационная база с таким именем в кластере уже существует.'"),
			ЭтотОбъект,
			"ИмяВКластере",
			,
			Отказ);
	КонецЕсли;
КонецПроцедуры
Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Описание = СтрШаблон(
		НСтр("ru = 'Записана информационная база %1 (имя в кластере: %2). Администратор: %3.'"),
		Наименование,
		ИмяВКластере,
		АдминистраторИнформационнойБазы);
	ПротоколУправленияСеансами.ЗаписатьОперацию(
		Перечисления.ОперацииУправленияСеансами.ИзменениеНастроекАдминистрирования,
		Ссылка,
		Описание);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
